# IsResultSchemaNameUnique Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..IsResultSchemaNameUnique Method
SpatialFieldManager Class See Also
---
Verify the uniqueness of the name among all registered result schemas.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsResultSchemaNameUnique(
	string name,
	int resultIndexToSkip
)
```

Visual Basic
---
```text
Public Function IsResultSchemaNameUnique ( _
	name As String, _
	resultIndexToSkip As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsResultSchemaNameUnique(
	String^ name,
	int resultIndexToSkip
)
```

# ### Parameters
name
    Type: System..::..String Name to verify uniqueness of.
resultIndexToSkip
    Type: System..::..Int32 Index of result (e.g. to be replaced) which names should not count for uniqueness; negative number means nothing is excluded from comparison.
# ### Return Value
True if name is unique, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace